print("Здравствуйте ,вы,новый иследыватель древнево храма Гирд!Выбери правельный путь... УДАЧИ!!!")
a = input("Перед тобой две дороги, куда пойдёшь?(направо / налево):")

if a == "направо":
    print("ты долго идёшь и вдруг потолог позади тебя обвалился!!!Что ты сделаешь ??? ")
s = input("Пойдёшь дальше/ попробуешь убрать завал")
if s == "Пойти дальше":
    print("ты пошёл по дороге дальше и увидел сундук !!! Ура вот это находка!!! Ты получаешь много золота и возврощаушься домой целым и невредимым")
elif s == "убрать завал":
    print("Ты пробуешь разобрать зовал у тебя не получается ! Пoзже на тебя падает камень ты погиб!!! Game over!!!"  )
elif a == "налево":
    print("Ты идёшь на тебя выползают змеи, но ты не пугаешся и обходишь их позже на тебя выходит главный страж и повилитель этого храма Гирда и нападает на тебя .Ты смотрешь что есть в твоём рюгзаке ")
backpak = ["Мечь","Волшебный кристал","Бутерброт"]
print(backpak)
print("Что тебе нужно?")
print("Ты решаешь использовать кристал")
k = backpak.pop[1]
print("Ты побеждаешь Гирду и находишь золотой меч и телепортируешься домой!Интересно что осталось в рюгзаке после путишествия")
backpak.append("Золотой меч")[1]
print(backpak)


